iarsystems/ewarm-toshiba-example-projects/TMPM4G8/Libraries/startup/startup_TMPM4G8.s
                PUBWEAK UsageFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
                B       UsageFault_Handler

                PUBWEAK SVC_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
                B       SVC_Handler

                PUBWEAK DebugMon_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
                B       DebugMon_Handler

                PUBWEAK PendSV_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
                B       PendSV_Handler

                PUBWEAK SysTick_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
                B       SysTick_Handler

                PUBWEAK INT00_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT00_IRQHandler
                B       INT00_IRQHandler

                PUBWEAK INT01_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT01_IRQHandler
                B       INT01_IRQHandler

                PUBWEAK INT02_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT02_IRQHandler
                B       INT02_IRQHandler

                PUBWEAK INT03_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT03_IRQHandler
                B       INT03_IRQHandler

                PUBWEAK INT04_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT04_IRQHandler
                B       INT04_IRQHandler

                PUBWEAK INT05_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT05_IRQHandler
                B       INT05_IRQHandler

                PUBWEAK INT06_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT06_IRQHandler
                B       INT06_IRQHandler

                PUBWEAK INT07_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT07_IRQHandler
                B       INT07_IRQHandler

                PUBWEAK INT08_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT08_IRQHandler
                B       INT08_IRQHandler

                PUBWEAK INT09_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT09_IRQHandler
                B       INT09_IRQHandler

                PUBWEAK INT10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT10_IRQHandler
                B       INT10_IRQHandler

                PUBWEAK INT11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT11_IRQHandler
                B       INT11_IRQHandler

                PUBWEAK INT12_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT12_IRQHandler
                B       INT12_IRQHandler

                PUBWEAK INT13_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT13_IRQHandler
                B       INT13_IRQHandler

                PUBWEAK INT14_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT14_IRQHandler
                B       INT14_IRQHandler

                PUBWEAK INT15_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INT15_IRQHandler
                B       INT15_IRQHandler

                PUBWEAK INTRTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRTC_IRQHandler
                B       INTRTC_IRQHandler

                PUBWEAK INTCEC0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCEC0RX_IRQHandler
                B       INTCEC0RX_IRQHandler

                PUBWEAK INTCEC0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCEC0TX_IRQHandler
                B       INTCEC0TX_IRQHandler

                PUBWEAK INTISDA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTISDA_IRQHandler
                B       INTISDA_IRQHandler

                PUBWEAK INTISDB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTISDB_IRQHandler
                B       INTISDB_IRQHandler

                PUBWEAK INTRMC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRMC0_IRQHandler
                B       INTRMC0_IRQHandler

                PUBWEAK INTRMC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRMC1_IRQHandler
                B       INTRMC1_IRQHandler

                PUBWEAK INTLTTMR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTLTTMR_IRQHandler
                B       INTLTTMR_IRQHandler

                PUBWEAK INTHDMAATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTHDMAATC_IRQHandler
                B       INTHDMAATC_IRQHandler

                PUBWEAK INTHDMAAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTHDMAAERR_IRQHandler
                B       INTHDMAAERR_IRQHandler

                PUBWEAK INTHDMABTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTHDMABTC_IRQHandler
                B       INTHDMABTC_IRQHandler

                PUBWEAK INTHDMABERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTHDMABERR_IRQHandler
                B       INTHDMABERR_IRQHandler

                PUBWEAK INTMDMAATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAATC_IRQHandler
                B       INTMDMAATC_IRQHandler

                PUBWEAK INTT32A00_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A00_A_CT_IRQHandler
                B       INTT32A00_A_CT_IRQHandler

                PUBWEAK INTT32A00_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A00_B_C01_CPC_IRQHandler
                B       INTT32A00_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A01_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A01_A_CT_IRQHandler
                B       INTT32A01_A_CT_IRQHandler

                PUBWEAK INTT32A01_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A01_B_C01_CPC_IRQHandler
                B       INTT32A01_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A02_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A02_A_CT_IRQHandler
                B       INTT32A02_A_CT_IRQHandler

                PUBWEAK INTT32A02_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A02_B_C01_CPC_IRQHandler
                B       INTT32A02_B_C01_CPC_IRQHandler

