iarsystems/ewarm-toshiba-example-projects/TMPM4G8/Libraries/startup/startup_TMPM4G8.s
                PUBWEAK INTI2C1NACK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C1NACK_IRQHandler
                B       INTI2C1NACK_IRQHandler

                PUBWEAK INTI2C2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2_IRQHandler
                B       INTI2C2_IRQHandler

                PUBWEAK INTI2C2AL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2AL_IRQHandler
                B       INTI2C2AL_IRQHandler

                PUBWEAK INTI2C2BF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2BF_IRQHandler
                B       INTI2C2BF_IRQHandler

                PUBWEAK INTI2C2NACK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C2NACK_IRQHandler
                B       INTI2C2NACK_IRQHandler

                PUBWEAK INTI2C3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3_IRQHandler
                B       INTI2C3_IRQHandler

                PUBWEAK INTI2C3AL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3AL_IRQHandler
                B       INTI2C3AL_IRQHandler

                PUBWEAK INTI2C3BF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3BF_IRQHandler
                B       INTI2C3BF_IRQHandler

                PUBWEAK INTI2C3NACK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C3NACK_IRQHandler
                B       INTI2C3NACK_IRQHandler

                PUBWEAK INTI2C4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4_IRQHandler
                B       INTI2C4_IRQHandler

                PUBWEAK INTI2C4AL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4AL_IRQHandler
                B       INTI2C4AL_IRQHandler

                PUBWEAK INTI2C4BF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4BF_IRQHandler
                B       INTI2C4BF_IRQHandler

                PUBWEAK INTI2C4NACK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2C4NACK_IRQHandler
                B       INTI2C4NACK_IRQHandler

                PUBWEAK INTADACP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACP0_IRQHandler
                B       INTADACP0_IRQHandler

                PUBWEAK INTADACP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACP1_IRQHandler
                B       INTADACP1_IRQHandler

                PUBWEAK INTADATRG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADATRG_IRQHandler
                B       INTADATRG_IRQHandler

                PUBWEAK INTADASGL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADASGL_IRQHandler
                B       INTADASGL_IRQHandler

                PUBWEAK INTADACNT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADACNT_IRQHandler
                B       INTADACNT_IRQHandler

                PUBWEAK INTADAHP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTADAHP_IRQHandler
                B       INTADAHP_IRQHandler

                PUBWEAK INTFLDRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLDRDY_IRQHandler
                B       INTFLDRDY_IRQHandler

                PUBWEAK INTFLCRDY0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLCRDY0_IRQHandler
                B       INTFLCRDY0_IRQHandler

                PUBWEAK INTFLCRDY1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLCRDY1_IRQHandler
                B       INTFLCRDY1_IRQHandler

                PUBWEAK INTMDMAABERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAABERR_IRQHandler
                B       INTMDMAABERR_IRQHandler

                PUBWEAK INTMDMAADERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAADERR_IRQHandler
                B       INTMDMAADERR_IRQHandler

                END
